class script(object):
    START_TXT = """Hᴇʏ {} {} !
    
✰ ɪ ᴀᴍ ᴀᴅᴠᴀɴᴄᴇᴅ ᴀɴᴅ ʏᴇᴛ ᴘᴏᴡᴇʀꜰᴜʟ ʀᴇɴᴀᴍᴇ ʙᴏᴛ, ᴜꜱɪɴɢ ᴍᴇ ʏᴏᴜ ᴄᴀɴ ʀᴇɴᴀᴍᴇ ᴀɴᴅ ᴄʜᴀɴɢᴇ ᴛʜᴜᴍʙɴᴀɪʟ ᴏꜰ ʏᴏᴜʀ ꜰɪʟᴇꜱ ᴏʀ ᴠɪᴅᴇᴏs ᴡɪᴛʜ ᴄᴜꜱᴛᴏᴍ ᴄᴀᴘᴛɪᴏɴ.
✰ ғɪʟᴇs - sᴜᴘᴘᴏʀᴛᴇᴅ ᴜᴘ ᴛᴏ 4ɢʙ"""

    ABOUT_TXT = """<b>─────「 ᴀʙᴏᴜᴛ ᴍᴇ 」─────
    
🤖 Mʏ Nᴀᴍᴇ : <a href='https://t.me/public_renamerbot'>Pʀᴇᴍɪᴜᴍ Rᴇɴᴀᴍᴇʀ</a>
👑 Oᴡɴᴇʀ :  <a href='https://t.me/mr_kallua'>₭𝐚𝐋𝐋Ꮼ𝐚 ...♡</a>
🧑🏻‍💻 Dᴇᴠᴇʟᴏᴘᴇʀ : <a href='https://t.me/PROFE07XHBOT'>「 #𝑷𝑹𝑶𝑭𝑬𝑺𝑺𝑶𝑹」🪐</a>
👥 Sᴜᴘᴘᴏʀᴛ Gʀᴏᴜᴘ : <a href='https://t.me/Noobseverywhere'>Nᴏᴏʙs Eᴠᴇʀʏᴡʜᴇʀᴇ</a>
🔐 Sᴏᴜʀᴄᴇ - Iᴛ's A Pʀɪᴠᴀᴛᴇ Rᴇᴘᴏ
✏️ Lᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ 𝟹
💾 Dᴀᴛᴀ Bᴀsᴇ : ᴍᴏɴɢᴏ ᴅʙ
📊 Bᴜɪʟᴅ Vᴇʀsɪᴏɴ : v1.0.1 [ ʙᴇᴛᴀ ]
•────────✦────────•</b>"""

    STATS = """────「 Bᴏᴛ Sᴛᴀᴛ𝗌 」────
 
Uᴩᴛɪᴍᴇ: {}
CPU Uꜱᴀɢᴇ: {}%
RAM Uꜱᴀɢᴇ: {}%
Tᴏᴛᴀʟ Dɪꜱᴋ: {}
Uꜱᴇᴅ Dɪꜱᴋ: {} ({}%)
Fʀᴇᴇ Dɪꜱᴋ: {}"""
    
    HELP_TXT = """
ʜᴇʏ {} ʜᴇʀᴇ ɪs ᴛʜᴇ ʜᴇʟᴘ ғᴏʀ ᴍʏ ᴄᴏᴍᴍᴀɴᴅs."""
    
    THUMB_TXT = """📝 𝗡𝗼𝘁𝗲 :

🌌 𝐇𝐨𝐰 𝐓o 𝐒𝐞𝐭 𝐓𝐡𝐮𝐦𝐛𝐧𝐚𝐢𝐥

Pʟᴇᴀsᴇ Sᴇɴᴅ Aɴʏ Pʜᴏᴛᴏ Tᴏ Mᴇ, Aɴᴅ I Wɪʟʟ Sᴀᴠᴇ Iᴛ Aᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ.

/delthumb : Usᴇ Tʜɪs Cᴏᴍᴍᴀɴᴅ Tᴏ Dᴇʟᴇᴛᴇ Oʟᴅ Tʜᴜᴍʙɴᴀɪʟ.

/viewthumb : Usᴇ Tʜɪs Cᴏᴍᴍᴀɴᴅ Tᴏ Vɪᴇᴡ Yᴏᴜʀ Cᴜʀʀᴇɴᴛ Tʜᴜᴍʙɴᴀɪʟ."""

    PREMIUM_TXT = """
<b>🔹𝐅𝐫𝐞𝐞 𝐔𝐬𝐞𝐫 𝐏𝐥𝐚𝐧 𝟐𝟎ɢʙ/ᴅᴀʏ
🔹𝐏𝐫𝐞𝐦𝐢𝐮𝐦 𝐔𝐬𝐞𝐫 𝐏𝐥𝐚𝐧 𝟓𝟎ɢʙ/ᴅᴀʏ
 
Tʜɪs Bᴏᴛ Is Tᴏᴛᴀʟʟʏ Fʀᴇᴇ Fᴏʀ Aʟʟ Bᴜᴛ Aᴛ Fɪʀsᴛ Yᴏᴜ Nᴇᴇᴅ Tᴏ Rᴇғᴇʀ Tᴡᴏ Fʀɪᴇɴᴅs Aɴᴅ Tʜᴇɴ Cᴏɴᴛᴀᴄᴛ Aᴅᴍɪɴ Yᴏᴜʀ Pʟᴀɴ Wɪʟʟ Bᴇ Uᴘɢʀᴀᴅᴇᴅ Tᴏ Pʀᴇᴍɪᴜᴍ 🤩

/refer 𝗙ᴏʀ 𝗥ᴇғᴇʀ ☑️

𝗦ʜᴀʀᴇ 𝗔ɴᴅ 𝗦ᴜᴘᴘᴏʀᴛ ❤️🙏</b>"""

    FREE_PLAN = """<b>ꜰʀᴇᴇ ᴘʟᴀɴ ᴜꜱᴇʀ</b>
ᴅᴀɪʟʏ ᴜᴘʟᴏᴀᴅ ʟɪᴍɪᴛ 10ɢʙ
ᴘʀɪᴄᴇ 0

ᴜᴘʟᴏᴀᴅ 2ɢʙ ꜰɪʟᴇꜱ
ᴅᴀɪʟʏ ᴜᴘʟᴏᴀᴅ: 5ɢʙ
ᴘᴀʀᴀʟʟᴇʟ ᴘʀᴏᴄᴇꜱꜱ: 2
ᴛɪᴍᴇᴏᴜᴛ: 5 ᴍɪɴᴜᴛᴇꜱ
ᴛɪᴍᴇ ɢᴀᴘ: ʏᴇꜱ"""

    SILVER_TXT = """<b>sɪʟᴠᴇʀ ᴘʟᴀɴ</b>

ᴜᴘʟᴏᴀᴅ 4ɢʙ ꜰɪʟᴇꜱ
ᴅᴀɪʟʏ ᴜᴘʟᴏᴀᴅ: 20.0ɢʙ
ᴘᴀʀᴀʟʟᴇʟ ᴘʀᴏᴄᴇꜱꜱ: 2
ᴛɪᴍᴇ ɢᴀᴘ: ɴᴏ ᴛɪᴍᴇ ɢᴀᴘ
ᴘʀɪᴄᴇ: ₹29 ᴘᴇʀ ᴍᴏɴᴛʜ"""

    GOLDEN_TXT = """<b>ɢᴏʟᴅ ᴘʟᴀɴ</b>

ᴜᴘʟᴏᴀᴅ 4ɢʙ ꜰɪʟᴇꜱ
ᴅᴀɪʟʏ ᴜᴘʟᴏᴀᴅ: 50.0ɢʙ 
ᴘᴀʀᴀʟʟᴇʟ ᴘʀᴏᴄᴇꜱꜱ: 3
ᴛɪᴍᴇ ɢᴀᴘ: ɴᴏ ᴛɪᴍᴇ ɢᴀᴘ
ᴘʀɪᴄᴇ: ₹49 ᴘᴇʀ ᴍᴏɴᴛʜ"""

    DIAMOND_TXT = """<b>ᴅɪᴀᴍᴏɴᴅ ᴘʟᴀɴ</b>

ᴜᴘʟᴏᴀᴅ 4ɢʙ ꜰɪʟᴇꜱ
ᴅᴀɪʟʏ ᴜᴘʟᴏᴀᴅ: 100.0ɢʙ
ᴘᴀʀᴀʟʟᴇʟ ᴘʀᴏᴄᴇꜱꜱ: 5
ᴛɪᴍᴇ ɢᴀᴘ: ɴᴏ ᴛɪᴍᴇ ɢᴀᴘ
ᴘʀɪᴄᴇ: ₹99 ᴘᴇʀ ᴍᴏɴᴛʜ"""

    UPGRADE_PLAN_TXT = """**🔹𝐅𝐫𝐞𝐞 𝐔𝐬𝐞𝐫 𝐏𝐥𝐚𝐧 𝟐𝟎ɢʙ/ᴅᴀʏ
🔹𝐏𝐫𝐞𝐦𝐢𝐮𝐦 𝐔𝐬𝐞𝐫 𝐏𝐥𝐚𝐧 𝟓𝟎ɢʙ/ᴅᴀʏ
 
Tʜɪs Bᴏᴛ Is Tᴏᴛᴀʟʟʏ Fʀᴇᴇ Fᴏʀ Aʟʟ Bᴜᴛ Aᴛ Fɪʀsᴛ Yᴏᴜ Nᴇᴇᴅ Tᴏ Rᴇғᴇʀ Tᴡᴏ Fʀɪᴇɴᴅs Aɴᴅ Tʜᴇɴ Cᴏɴᴛᴀᴄᴛ Aᴅᴍɪɴ Yᴏᴜʀ Pʟᴀɴ Wɪʟʟ Bᴇ Uᴘɢʀᴀᴅᴇᴅ Tᴏ Pʀᴇᴍɪᴜᴍ 🤩

/refer 𝗙ᴏʀ 𝗥ᴇғᴇʀ ☑️

𝗦ʜᴀʀᴇ 𝗔ɴᴅ 𝗦ᴜᴘᴘᴏʀᴛ ❤️🙏**"""
    
    CAPTION_TXT = """📝 𝗡𝗼𝘁𝗲 :

📌 𝐇𝐨𝐰 𝐓𝐨 𝐒𝐞𝐭 𝐀 𝐂𝐮𝐬𝐭𝐨𝐦 𝐂𝐚𝐩𝐭𝐢𝐨𝐧

EX- <code>/set_caption {filename}
{filesize}</code>

/set_caption - Sᴇᴛ A Cᴜsᴛᴏᴍ Cᴀᴘᴛɪᴏɴ Fᴏʀ Yᴏᴜʀ Cᴏɴᴛᴇɴᴛ.

/see_caption - Tᴏ Yɪᴇᴡ ʏᴏᴜʀ Cᴜsᴛᴏᴍ Cᴀᴘᴛɪᴏɴ.

/delete_caption - Rᴇᴍᴏᴠᴇ Yᴏᴜʀ Cᴜsᴛᴏᴍ Cᴀᴘᴛɪᴏɴ Fʀᴏᴍ Mʏ Dᴀᴛᴀʙᴀsᴇ."""
    
    SOURCE_TXT = """<b>─────「 𝐀𝐥𝐥 𝐁𝐎𝐓𝐒 」─────

🏷 𝗟𝗲𝗲𝗰𝗵 𝗕𝗼𝘁𝘀 
[ 𝙼𝙰𝚇 𝙻𝙴𝙴𝙲𝙷 𝚉𝙾𝙽𝙴 💡](https://t.me/+6aN3J2yRbd9jNjk9)

🏷 𝗕𝘆𝗽𝗮𝘀𝘀 𝗕𝗼𝘁
[ 𝙼𝙰𝚇 𝙱𝚈𝙿𝚂𝚂𝚂 𝚉𝙾𝙽𝙴 𝚅𝟷 🚸](https://telegram.me/File_ToLink_Max_Bot?start)

🏷 𝗙𝗶𝗹𝗲 𝗧𝗼 𝗟𝗶𝗻𝗸 𝗕𝗼𝘁𝘀 
[ Fɪʟᴇ Tᴏ Lɪɴᴋ ❤️‍🔥 ](https://telegram.me/ProFileToLinkBot?start)
[ 𝗠𝗮𝘅 𝗙𝗶𝗹𝗲 𝗧𝗼 𝗟𝗶𝗻𝗸 ♻️](https://telegram.me/File_ToLink_Max_Bot?start)
 
🏷 𝟰𝗚𝗕 𝗥𝗲𝗻𝗮𝗺𝗲 𝗕𝗼𝘁 
[ Pʀᴇᴍɪᴜᴍ Rᴇɴᴀᴍᴇʀ 📝](https://telegram.me/public_renamerbot?start)

🏷 𝗠𝗼𝘃𝗶𝗲𝘀/𝗦𝗲𝗿𝗶𝗲𝘀 𝗕𝗼𝘁
[ Gʀɪᴍ Rᴇᴀᴘᴇʀ ☠](https://telegram.me/grim_reaper_moviesbot?start)</b>"""
